PS C:\Users\Subham Sarkar\Documents\musicKeras\char-rnn-keras-master> & python "c:/Users/Subham Sarkar/Documents/musicKeras/char-rnn-keras-master/model.py"
Using TensorFlow backend.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
embedding_1 (Embedding)      (16, 64, 512)             25600
_________________________________________________________________
lstm_1 (LSTM)                (16, 64, 256)             787456
_________________________________________________________________
dropout_1 (Dropout)          (16, 64, 256)             0
_________________________________________________________________
lstm_2 (LSTM)                (16, 64, 256)             525312
_________________________________________________________________
dropout_2 (Dropout)          (16, 64, 256)             0
_________________________________________________________________
lstm_3 (LSTM)                (16, 64, 256)             525312
_________________________________________________________________
dropout_3 (Dropout)          (16, 64, 256)             0
_________________________________________________________________
time_distributed_1 (TimeDist (16, 64, 50)              12850
_________________________________________________________________
activation_1 (Activation)    (16, 64, 50)              0
=================================================================
Total params: 1,876,530
Trainable params: 1,876,530
Non-trainable params: 0
_________________________________________________________________
